Tekla.Structures.ModelInternal.dotSetProperty_t
Serialization structure for the Set property method

Tekla.Structures.ModelInternal.dotSetProperty_t.aName
Name of the property

Tekla.Structures.ModelInternal.dotSetProperty_t.Type
Type of the property

Tekla.Structures.ModelInternal.dotSetProperty_t.Source
Where to get the property (UDA/Report)

Tekla.Structures.ModelInternal.dotSetProperty_t.FatherId
ID of the part whose property we wish to get or set

Tekla.Structures.ModelInternal.dotSetProperty_t.IntValue
Integer return value

Tekla.Structures.ModelInternal.dotSetProperty_t.DoubleValue
Double return value

Tekla.Structures.ModelInternal.dotSetProperty_t.aStringValue
String return value